/*
2.6 建表类型[字符串]
字符串类型
  char    固定长度类型 一旦声明固定占有对应的空间 M 最大255 [性能较好]
  varchar 可变长度类型 一旦声明,可以插入小于的长度,自动进行伸缩 M 占有的空间不能超过一行的最大显示65535字节 [性能一般]
  text    大文本类型 声明不要指定长度,有固定的大小限制, text [65535], 不占有一行的最大限制空间

细节理解
  1. char声明的时候可以不写m  char = char(1)
  2. char声明了最大长度限制,输入的文本小于长度限制,会在右侧补全空格  char(5) -> 'abc' -> 'abc  '
  3. char类型在读取的时候,会自动去掉右侧的空格  'abc  ' -> 'abc'
  4. varchar声明的时候,必须添加m限制  varchar(m)
  5. mysql4.0以下版本  varchar(20) -> 20字节限制  utf8mb3下最多存6个字符
  6. mysql5.0以上版本  varchar(20) -> 20字符限制
  7. varchar类型中识别空格,插入空格 读取也是有空格

演示varchar最大限制
  前提: mysql中一行数据最大的占有空间是65535字节,除了TEXT or BLOBs类型的列(不占有65535限制 法外狂徒)
  一行 -> name1列 -> name1列占有的最大空间65535字节
  varchar类型默认会使用1字节标识是否为null  ->  65535 - 1 = 65534字节
  字符集utf8mb4  1个字符 = 4个字节  ->  65534 / 4 = 16383

解决方案:
  1. 缩小字符大小限制 m变小 [不合理]
  2. 可以修改字符集 [不合理]
  3. 可以将字符串类型变成TEXT,不占有一行的限制
*/
