/*
3.2 数据操作语言[修改]
语法
  全表修改(全行修改)
    update 表名 set 列名 = 新值, 列名 = 值, 列名 = 值 ...
  条件修改(条件筛选行)
    update 表名 set 列名 = 新值, 列名 = 值, 列名 = 值 ... where 条件

注意
  1. 不添加where,代表修改一个表中的所有行的数据,反之,只修改符合where条件的
  2. 如果修改多个列,set 列名 = 值, 列名 = 值

练习
  # 1.将学号为8的学生的姓名改为'黄六'。
  # 2.将年龄小于20岁的学生的身高增加2.0。
  # 3.将学号为11的学生的生日修改为'2003-07-10',且年龄改成21。
  # 4.将所有学生的年龄减少1岁。
*/
# 插入学生数据准备数据
INSERT INTO students (stu_id, stu_name, stu_age, stu_birthday, stu_height)
VALUES
(6, '张三', 21, '2002-05-10', 175.5),
(7, '李四', 20, '2003-02-15', 168.0),
(8, '王五', 22, '2001-09-20', 180.2),
(9, '赵六', 19, '2004-03-08', 165.8),
(10, '钱七', 23, '2000-12-01', 172.3),
(11, '孙八', 20, '2003-06-25', 160.5),
(12, '周九', 21, '2002-11-18', 175.0),
(13, '吴十', 22, '2001-04-30', 168.7),
(14, '郑十一', 19, '2004-08-12', 185.5),
(15, '王十二', 23, '2000-07-05', 170.1);
# 1.将学号为8的学生的姓名改为'黄六'。
UPDATE students SET stu_name = '黄六' WHERE stu_id =8;
# 2.将年龄小于20岁的学生的身高增加2.0。
UPDATE students SET stu_height = stu_height+2.0 WHERE stu_age<20;
# 3.将学号为11的学生的生日修改为'2003-07-10',且年龄改成21。
UPDATE students SET stu_birthday = '2003-07-10' , stu_age = 21 WHERE stu_id = 11;
# 4.将所有学生的年龄减少1岁。
UPDATE students SET stu_age = stu_age-1;
